CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
CIBC
Aventura®
Aeroplan®
Aventura®
Aeroplan®
Aventura®
Aventura®
Aeroplan®
Aventura®
Aeroplan®
Dividend®
Dividend
Dividend®
Dividend®
Costco
U.S.
Select
Aventura®
Aeroplan®
Costco
Aventura®
Aeroplan®
bizline®
Corporate
Classic
Classic
Visa
Visa
Visa
Visa
Gold
Visa*
Visa*
Visa*
Visa*
Visa
Platinum®
Visa*
Visa*
Mastercard®
Dollar
Visa*
Visa*
Visa*
Business
Visa*
Visa*
Visa*
Classic
Visa*
Visa*
Infinite*
Infinite*
Infinite
Infinite
Visa*
Card
Card
Card
Card
Infinite*
Visa*
Card
Card
Aventura®
Card
Card
Business
Mastercard®
Card
Business
Card
Plus
Card
Card
Card
Card
Privilege*
Privilege*
Card
Card
Card
Gold
Card
Visa*
TRAVEL
TRAVEL
TRAVEL
TRAVEL
TRAVEL
TRAVEL
TRAVEL
Card
Card
Card
Students
Students
Students
Business
Card
Visa*
Students
Business
STUDENT
STUDENT
CASH
CASH
CASH
STUDENT
COSTCO
TRAVEL
LOW
Card
BUSINESS
BUSINESS
BUSINESS
BUSINESS
BUSINESS
BUSINESS
STUDENT
Plus
CARDS
CARDS
CARDS
CARDS
CREDIT
CREDIT
CREDIT
CREDIT
CREDIT
CREDIT
ANNUAL
CARDS
REWARDS
REWARDS
REWARDS
REWARDS
REWARDS
REWARDS
REWARDS
CARDS
CARDS
BACK
BACK
BACK
CARDS
CARDS
REWARDS
INTEREST
CARDS
CARDS
CARDS
CARDS
CARDS
CARDS
FEE
CARDS
CARDS
CARDS
CARDS
CARDS
CARDS
CARDS
CARDS
CARDS
card
low
low
low
Prime
plus
CIBC
Quebec
CIBC
residents
residents
non-Quebec
non-Quebec
non-Quebec
non-Quebec
non-Quebec
non-Quebec
non-Quebec
non-Quebec
non-Quebec
non-Quebec
non-Quebec
non-Quebec
non-Quebec
Quebec
points
points
points
points
points
point
point
point
point
cash
cash
cash
cash
cash
point
points
points
cash
points
points
automatic
money
residents
residents
residents
residents
residents
residents
residents
residents
residents
residents
residents
residents
residents
residents
residents
Quebec
residents
plus
residents
Quebec
Quebec
Quebec
Quebec
Quebec
Quebec
Quebec
Quebec
Quebec
Quebec
Quebec
Quebec
Quebec
Quebec
Quebec
residents
residents
residents
residents
residents
residents
residents
residents
residents
residents
residents
residents
residents
residents
residents
Prime
per
per
per
per
per
per
per
per
per
back
back
back
back
back
credit
savings
abroad
membership
Access
Enjoy
Send
Free
residents
through
Canada®
through
Canada®
through
through
Canada®
through
Canada
vehicle
vehicle
cash
cash
gas
through
Save
through
Canada®
restaurants
through
Canada®
Securely
with
Installment
booked
Air
booked
Air
booked
booked
Air
booked
Air
electric
electric
Costco
booked
rebate
booked
Air
and
booked
Air
charging
charging
access
CIBC
Plans
travel
with
travel
with
travel
travel
with
travel
with
gas
gas
groceries
groceries
and
travel
fee
travel
with
gas
travel
with
SavingsEdge
transfer
year
limit
with
with
directly
directly
directly
directly
eligible
eligible
eligible
eligible
restaurants
directly
Costco
directly
Visa
CIBC
points
points
points
point
point
back
back
vehicle
vehicle
gas
point
litre
points
at
points
under
your
off
cents
cash
cash
electric
electric
other
cardholders
for
Pay
Centre4
Vacations®
Centre7
Vacations®
Centre5
Centre4
Vacations®
Centre
Vacations®
at
Centre
cents
Centre
information
Transfer
td
TD Bank
Td bank
TD
CIBC
Air
CIBC
Air
CIBC
CIBC
Air
CIBC
Air
and
and
on
on
cash
CIBC
to
CIBC
Air
cash
CIBC
Air
up
all
Global
Save
Rewards
Canada
Rewards
Canada
Rewards
Rewards
Canada
Rewards
Canada
groceries
groceries
eligible
eligible
back
Rewards
Rewards
Canada
back
Rewards
Canada
to
account
Money
up
on
dining
on
transportation
transportation
dining
and
vehicle
with
on
shipping
on
CIBC
to
with
on
per
eligible
per
per
per
eligible
eligible
transportation
transportation
electric
every
gas
per
on
per
account
Up
purchases
litre
per
points
points
point
per
point
charging
charging
stations
for
on
per
points
Costco.ca
per
points
one
business
large
per
vehicle
electric
vehicle
electric
vehicle
vehicle
electric
vehicle
electric
payments
payments
Save
other
Rewards
vehicle
travel
at
vehicle
travel
you
rentals
low
and
electric
gas
electric
gas
electric
electric
gas
electric
gas
recurring
recurring
payments3
Free
and
all
Journie
electric
cable
services
electric
cable
helps
car
It™
CIBC
eligible
transportation
eligible
eligible
eligible
dining
dining
and
recurring
charging
spent
CIBC
eligible
eligible
CreditSmart
CIBC
gas
eligible
gas
eligible
eligible
and
and
recurring
payments
stations
and
gas
internet
insurance
gas
internet
off
Pace
with
and
and
groceries
groceries
and
and
and
and
and
Insurance
gas
Extended
Pace
currency
abroad
hotels
more
stations
travel
more
credit
Avis®
Plans‡
charging
vehicle
charging
vehicle
charging
charging
vehicle
charging
vehicle
Mobile
Save
on
membership
Costco
purchases
dining
other
charging
dining
track
at
rate
Journie
grocery
charging
and
charging
grocery
grocery
charging
grocery
charging
Device
on
gas
CIBC
No
money
flights
and
gas
and
and
your
participating
Installment
Rewards
purchases
First
travel
and
purchases
purchases
Preferred
purchases
Preferred
Save
Auto
warranty
Installment
fees
other
bag
at
Transfer
bag
activity
Budget®
up
Lounge
bag
credit
dining
Lounge
Book
pricing
Free
pricing
on
Rental
Pay
Plans
for
transfer
travel
free
electric
Aventura
free
locations
to
drugstore
groceries
Annual
travel
drugstore
drugstore
groceries
drugstore
groceries
Extended
warranty5
It™
conversion
with
and
First
and
purchases6
First
card
and
Save
Lounge
access
travel
gas
Collision
CIBC
in
Special
USD
fee
Transfer
vehicle
points
cents
per
litre
on
gas
application
Visa
assistance
twice
CIBC
twice
concierge
Pay
Installment
with
eligible
Pace
Global
between
access
CIBC
on
access
Lounge
access
with
Earn
membership
Earn
Insurance5
Pace
installments
rates
purchases
with
Aventura
charging
between
CIBC
points
Lounge
stations
accounts
Lounge
access
NEXUSTM
personalized
points
points
Visa
ItTM
fee
First
fee
at
Pace
at
services6
in
Plans
CIBC
Costco
Preferred
Money
accounts
pricing
Plans
fee
free
rebate
service
bag
rebate8
over
over
It
installments
Preferred
Installment
purchases
pricing
Transfer
Installment
Preferred
and
Priority
retailers
Plans
retailers
Visa*
rebate
Special
and
rates
on
Rewards
service
pricing
more
Airport
eligible
Costco
purchases
Visa
Avion
Rewards
First
AIR
Momentum
Scene
TRUE
American
Value
AIR
eclipse
Essential
CashBack
Ascend
Passport
Platinum
Gold
CashBack
eclipse
Cash
Low
Card
CashBack
Rewards
Classic
Visa
World
Class
MILES
Visa
Visa
Line
Express
Visa
MILES
Visa
Mastercard
Mastercard
World
Visa
Travel
American
World
rise
Back
Rate
Business
World
RBC
RBC
WestJet
RBC
moi
RBC
RBC
RBC
RBC
RBC
RBC
RBC
RBC
WestJet
RBC
RBC
RBC
RBC
RBC
RBC
RBC
RBC
MBNA
TD
TD Bank
BMO
Scotia
Scotiabank
MBNA
Scotiabank
Scotiabank
BMO
BMO
KOHO
BMO
BMO
Scotiabank
TD
Scotiabank
BMO
BMO
TD
TD
Loop
BMO
MBNA
purchases
purchases
Visa
Visa
World
Visa
Visa
Back
Back
Classic
Visa
Visa
Platinum
Visa
Dollar
Mastercard
Airways
Visa
Visa
Cash
Business
CreditLine
purchases
purchases
purchases
purchases
purchases
purchases
purchases
purchases
purchases
purchases
purchases
purchases
purchases
Avion
RBC
ION
RBC
Cash
Cash
Visa
Avion
Avion
Visa
RateAdvantage
U.S.
RBC
British
Avion
Avion
Business
Visa
Visa
Low
Infinite
Elite
Travel
World
Infinite
Card
Mastercard
Card
Card
Mastercard
Infinite
Card
Option
Elite
Infinite
Visa
Express
Elite
Visa
Visa
Visa
Mastercard
Elite
Mastercard
Card
Card
Card
Mastercard
Card
Infinite
Card
Card
Card
Mastercard
Rate
Privilege
Mastercard
Visa
Elite
Card
Infinite
Mastercard
advances
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Oct
Scotiabank
Scotia
Scotia
Scotiabank
Scotiabank
Scotia
Scotia
Scotiabank®
Scotiabank
Scotiabank
Scotiabank
Scotiabank
Scotia
Scotia
Scotiabank®
Scotiabank®
Infinite
Elite
Preferred
Mastercard
Low
Infinite
Platinum
Visa
Visa
Infinite
Business
Back
for
cash
cash
cash
cash
cash
cash
cash
cash
cash
cash
cash
cash
cash
cash
advances
advances
advances
advances
advances
advances
advances
advances
advances
advances
advances
advances
cash
advances
advances
Mastercard
Business
Small
Mastercard
advances
Mastercard
World
Elite
Rate
Privilege
Option
Infinite
Business
Gold
GeniusCash
GeniusCash
GC
GeniusCash
GeniusCash
GeniusCash
GeniusCash
GeniusCash
GeniusCash
GeniusCash
GeniusCash
GC
GeniusCash
GeniusCash
GeniusCash
GeniusCash
GeniusCash
GC
GeniusCash
GC
GeniusCash
GeniusCash
GeniusCash
GeniusCash
Boost
points
bonus
points
for
points
points
bonus
on
Scene
Rewards
on
for
annual
purchases
interest
in
supplies
bonus
of
bonus
TD Bank
purchases
bonus
for
bonus
of
back
back
bonus
TD
return
back
eligible
card
fees
office
rates
on
transfers
rates
to
cash
cash
cash
on
on
Express®
Infinite*
Visa*
Express®
Infinite*
Card
credit
Card
Card
Card
Card
Card
Card
Visa
Visa
Card
American
Visa
No-Fee
American
Visa
Visa*
Mastercard®
Visa
Express®
Express
Visa*
Visa
Visa
No-Fee
Dollar
Visa
Card
Card
Card
Card
Card
card
(for
(for
(for
Card
Card
for
students
students
students
students
interest
to
back
balance
interest
Up
to
to
back
low
no
back
to
permanent
to
Up
to
to
cash
to
on
to
permanent
to
Exclusive
to
to
to
to
to
Up
to
Up
cash
a
owners
cash
Up
Up
Up
Low
Up
Up
Up
Up
Up
Up
Up
Get
Business
Low
Up
Up
Up
for
students
Low
Annual
Air
months
Up
Up
First
Miles
points
bonus
points
months
points
of
popular
points
bonus
months
Air
bonus
purchases
bonus
points
points
groceries
bonus
for
rate
for
points
annual
free
birthday
bonus
Miles
to
fee
to
year
cash
Up
Up
months
currencies
months
Annual
fee
lounge
bonus
of
free
Triple
interest
back
free
to
to
First
Save
bonus
per
up
to
miles
back
per
annual
per
Miles
at
on
your
no
lounge
lounge
points
fee
to
assistance
points
annual
annual
up
passes
worth
up
Triple
cash
points
No
points
miles
points
on
for
free
airport
year
up
Roadside
No
No
worth
year
to
at
on
fee
Air
gas
balance
annual
passes
passes
per
waived
points
Air
groceries
spent
spent
Miles
&
fee
partners
cents
points
spent
Scene
at
bonus
partners
groceries
points
Shell
year
CIBC Aventura® Visa Infinite* Card
Visa Infinite Card
CIBC Aeroplan® Visa Infinite* Card
CIBC Aventura® Visa Infinite Privilege* Card
Visa Infinite Privilege Card
CIBC Aeroplan® Visa Infinite Privilege* Card 
CIBC Aventura® Gold Visa* Card
Gold Visa Card
CIBC Aventura® Visa* Card
Visa Card
CIBC Aeroplan® Visa* Card
CIBC Aventura® Visa* Card for Students
CIBC Aeroplan® Visa* Card for Students
Visa Card for Students
CIBC Dividend® Visa Infinite* Card
CIBC Dividend Platinum® Visa* Card
CIBC Dividend® Visa* Card
CIBC Dividend® Visa* Card for Students
CIBC Costco Mastercard®
CIBC U.S. Dollar Aventura® Gold Visa* Card
CIBC Select Visa* Card
CIBC Aventura® Visa* Card for Business
CIBC Aeroplan® Visa* Business Card
CIBC Costco Business Mastercard®
CIBC Aventura® Visa* Card for Business Plus
CIBC Aeroplan® Visa* Business Plus Card
CIBC bizline® Visa* Card
CIBC Corporate Classic Plus Visa* Card
CIBC Classic Visa* Card
CIBC Classic Visa* Card for Students
TRAVEL REWARDS CARDS
TRAVEL REWARDS CARDS
TRAVEL REWARDS CARDS
TRAVEL REWARDS CARDS
TRAVEL REWARDS CARDS
TRAVEL REWARDS CARDS
TRAVEL REWARDS CARDS
STUDENT CARDS
STUDENT CARDS
CASH BACK CARDS
CASH BACK CARDS
CASH BACK CARDS
STUDENT CARDS
COSTCO CARDS
TRAVEL REWARDS CARDS
LOW INTEREST CARDS
BUSINESS CREDIT CARDS
BUSINESS CREDIT CARDS
BUSINESS CREDIT CARDS
BUSINESS CREDIT CARDS
BUSINESS CREDIT CARDS
BUSINESS CREDIT CARDS
STUDENT CARDS
TD Cash Back Visa Infinite*
TD Cash Back Visa*
TD® Aeroplan® Visa Infinite*
TD® Aeroplan® Visa Platinum*
TD® Aeroplan® Visa Infinite Privilege*
TD First Class Travel® Visa Infinite*
TD Platinum Travel Visa*
TD Rewards Visa*
TD U.S. Dollar Visa*
TD Business Travel Visa*
TD® Aeroplan® Visa*
Business Visa Card
TD Business Cash Back Visa*
TD Business Select Rate Visa*
Scotiabank Passport® Visa Infinite* Card
Scotiabank Gold American Express® Card
Scotia Momentum® Visa Infinite* Card
Scotiabank Passport® Visa Infinite* Card
Scotiabank Gold American Express® Card
Scotiabank American Express® Card
Scotia Momentum® Visa Infinite* Card
Scotia Momentum® Visa*  Card
Scotia Momentum® No-Fee Visa* Card
Scotiabank® Scene+TM Visa* Card	Visa Card
Scotiabank Passport® Visa Infinite* Card
Scotiabank Gold American Express® Card
Scotiabank® Scene+TM Visa* Card (for students)
Scotia Momentum® No-Fee Visa* Card (for students)
Scotia Momentum® Visa* Card (for students)
Scotiabank® Scene+TM Visa* Card	Visa Card
Scotia Momentum® No-Fee Visa* Card
Scotiabank American Express® Card
American Express
Visa Card





